$(document).ready(function() {
    var names = ["Анастасия","Дмитрий","Милана","Дарина","Тимофей","Александр","София","Мария","Юрий","Иван","Ясмина","Виктория","Михаил","Агния","Фёдор","Мадина","Маргарита","Арина","Алиса","Мирон","Сергей","Алёна","Александра","Тигран","Фатима","Григорий","Владимир","Евангелина","Давид","Кирилл","Илья","Никита","Павел","Злата","Вероника","Дарья","Есения","Аиша","Елизавета","Глеб","Кристина","Матвей","Виктор","Жасмин","Анна","Варвара","Георгий","Вера","Ярослав","Ксения","Демьян","Егор","Максим","Эмилия","Ульяна","Майя","Савва","Василий","Константин","Юлия","Арсений","Ева","Семён","Антон","Амелия","Надежда","Олеся","Вадим","Софья","Стефания","Наталья","Аделина","Ангелина","Полина","Мия","Алина","Сафия","Марк","Николь","Артём","Дамир","Лев","Пётр","Денис","Роман","Зоя","Алексей","Марьяна","Любовь","Артемий","Нина","Елисей","Олег","Диана","Ян","Виолетта","Василиса","Ибрагим","Айлин","Агата"];
    $("#name_id").autocomplete({
        source: names
    },
    {
        autoFocus: true,
        maxShowItems: 5
    });
})
